---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColorByObject
source: html/00135055-9bf2-2f0c-cb5b-067ab92d922d.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColorByObject Property

The property labeled "Color By Object" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintBaseColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".